Name: Minhas Ahmed

In [4]:
import pandas as pd

In [5]:
import numpy as np

In [6]:
df = pd.read_csv("Laptop-Price.csv")
print(df)

     Company                                    Product            TypeName  \
0         HP                                     250 G6            Notebook
1       Acer                                   Aspire 3            Notebook
2       Asus                            ZenBook UX430UN           Ultrabook
3       Acer                                    Swift 3           Ultrabook
4         HP                                     250 G6            Notebook
...      ...                                        ...                 ...
1141    Dell                              Inspiron 3567            Notebook
1142    Asus  X556UJ-XO044T (i7-6500U/4GB/500GB/GeForce            Notebook
1143  Lenovo                             Yoga 500-14ISK  2 in 1 Convertible
1144  Lenovo                             Yoga 900-13ISK  2 in 1 Convertible
1145      HP        15-AC110nv (i7-6500U/6GB/1TB/Radeon            Notebook

      Inches                            ScreenResolution   Ram       OpSys  \
0       15.6                           Full HD 1920x1080   8GB       No OS
1       15.6                                    1366x768   4GB  Windows 10
2       14.0                           Full HD 1920x1080  16GB  Windows 10
3       14.0                 IPS Panel Full HD 1920x1080   8GB  Windows 10
4       15.6                                    1366x768   4GB       No OS
...      ...                                         ...   ...         ...
1141    15.6                                    1366x768   8GB       Linux
1142    15.6                                    1366x768   4GB  Windows 10
1143    14.0   IPS Panel Full HD / Touchscreen 1920x1080   4GB  Windows 10
1144    13.3  IPS Panel Quad HD+ / Touchscreen 3200x1800  16GB  Windows 10
1145    15.6                                    1366x768   6GB  Windows 10

     Cpu Brand       Cpu Model Cpu Rate  SSD  HDD  Flash Storage  Hybrid  \
0        Intel   Core i5 7200U   2.5GHz  256    0              0       0
1          AMD  A9-Series 9420     3GHz    0  500              0       0
2        Intel   Core i7 8550U   1.8GHz  512    0              0       0
3        Intel   Core i5 8250U   1.6GHz  256    0              0       0
4        Intel   Core i5 7200U   2.5GHz    0  500              0       0
...        ...             ...      ...  ...  ...            ...     ...
1141     Intel   Core i7 7500U   2.7GHz    0    1              0       0
1142     Intel   Core i7 6500U   2.5GHz    0  500              0       0
1143     Intel   Core i7 6500U   2.5GHz  128    0              0       0
1144     Intel   Core i7 6500U   2.5GHz  512    0              0       0
1145     Intel   Core i7 6500U   2.5GHz    0    1              0       0

     Gpu Brand         Gpu Model  Unnamed: 16  Price_euros
0        Intel   HD Graphics 620          NaN       575.00
1          AMD         Radeon R5          NaN       400.00
2       Nvidia     GeForce MX150          NaN      1495.00
3        Intel  UHD Graphics 620          NaN       770.00
4        Intel   HD Graphics 620          NaN       393.90
...        ...               ...          ...          ...
1141       AMD    Radeon R5 M430          NaN       805.99
1142    Nvidia      GeForce 920M          NaN       720.32
1143     Intel   HD Graphics 520          NaN       638.00
1144     Intel   HD Graphics 520          NaN      1499.00
1145       AMD    Radeon R5 M330          NaN       764.00

[1146 rows x 18 columns]

In [8]:
k = pd.Series([1, 3, 5, np.nan, 6, 8])
print(k)

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [10]:
dates = pd.date_range("20130101", periods=6)
print(dates)

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [13]:
df = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["HP", "Acer", "Dell", "Lenovo"]),
        "F": "full",
    }
)
print(df)

     A          B    C  D       E     F
0  1.0 2013-01-02  1.0  3      HP  full
1  1.0 2013-01-02  1.0  3    Acer  full
2  1.0 2013-01-02  1.0  3    Dell  full
3  1.0 2013-01-02  1.0  3  Lenovo  full

In [14]:
df.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [15]:
df.head()

     A          B    C  D       E     F
0  1.0 2013-01-02  1.0  3      HP  full
1  1.0 2013-01-02  1.0  3    Acer  full
2  1.0 2013-01-02  1.0  3    Dell  full
3  1.0 2013-01-02  1.0  3  Lenovo  full

In [16]:
df.index

Index([0, 1, 2, 3], dtype='int64')

In [17]:
df.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'HP', 'full'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'Acer', 'full'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'Dell', 'full'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'Lenovo', 'full']],
      dtype=object)

In [18]:
df.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [19]:
df.describe()

         A                    B    C    D
count  4.0                    4  4.0  4.0
mean   1.0  2013-01-02 00:00:00  1.0  3.0
min    1.0  2013-01-02 00:00:00  1.0  3.0
25%    1.0  2013-01-02 00:00:00  1.0  3.0
50%    1.0  2013-01-02 00:00:00  1.0  3.0
75%    1.0  2013-01-02 00:00:00  1.0  3.0
max    1.0  2013-01-02 00:00:00  1.0  3.0
std    0.0                  NaN  0.0  0.0

In [20]:
df.T

,0,1,2,3
A,1.0,1.0,1.0,1.0
B,2013-01-02 00:00:00,2013-01-02 00:00:00,2013-01-02 00:00:00,2013-01-02 00:00:00
C,1.0,1.0,1.0,1.0
D,3,3,3,3
E,HP,Acer,Dell,Lenovo
F,full,full,full,full

In [21]:
df.sort_index(axis=1, ascending=False)

      F       E  D    C          B    A
0  full      HP  3  1.0 2013-01-02  1.0
1  full    Acer  3  1.0 2013-01-02  1.0
2  full    Dell  3  1.0 2013-01-02  1.0
3  full  Lenovo  3  1.0 2013-01-02  1.0

In [22]:
df.sort_values(by="B")

     A          B    C  D       E     F
0  1.0 2013-01-02  1.0  3      HP  full
1  1.0 2013-01-02  1.0  3    Acer  full
2  1.0 2013-01-02  1.0  3    Dell  full
3  1.0 2013-01-02  1.0  3  Lenovo  full

In [26]:
m = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range("20130102", periods=6))
print(m)

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [28]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)
print(s)

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [29]:
s = pd.Series(np.random.randint(0, 7, size=10))
print(s)

0    3
1    5
2    4
3    4
4    2
5    3
6    5
7    5
8    6
9    5
dtype: int32

In [30]:
s = pd.Series(["Dell", "HP", "Lenovo", "Acer", "Huawei", np.nan, "Samsung", "Apple", "Google Book"])
print(s)

0           Dell
1             HP
2         Lenovo
3           Acer
4         Huawei
5            NaN
6        Samsung
7          Apple
8    Google Book
dtype: object

In [31]:
df = pd.DataFrame(np.random.randn(10, 4))
print(df)

          0         1         2         3
0  0.460849  0.487761 -0.736919 -0.178876
1 -0.286265 -0.672739  0.979066  0.342475
2  0.243242 -0.250386  0.216199  1.492320
3 -1.111056 -0.790975 -1.231890 -1.527195
4 -2.352742  1.157813 -0.683316  1.037596
5 -1.704849  0.508804  1.362565 -2.113129
6 -1.415796  0.894546 -0.127387  0.787628
7 -0.107892  0.351823  0.287813  2.796400
8  0.477150  1.559146  1.677657  1.009932
9 -0.330902 -0.417962 -0.975267 -0.439529

In [35]:
stacked = df.stack(future_stack=True)
print(stacked)

0  0    0.460849
   1    0.487761
   2   -0.736919
   3   -0.178876
1  0   -0.286265
   1   -0.672739
   2    0.979066
   3    0.342475
2  0    0.243242
   1   -0.250386
   2    0.216199
   3    1.492320
3  0   -1.111056
   1   -0.790975
   2   -1.231890
   3   -1.527195
4  0   -2.352742
   1    1.157813
   2   -0.683316
   3    1.037596
5  0   -1.704849
   1    0.508804
   2    1.362565
   3   -2.113129
6  0   -1.415796
   1    0.894546
   2   -0.127387
   3    0.787628
7  0   -0.107892
   1    0.351823
   2    0.287813
   3    2.796400
8  0    0.477150
   1    1.559146
   2    1.677657
   3    1.009932
9  0   -0.330902
   1   -0.417962
   2   -0.975267
   3   -0.439529
dtype: float64

In [36]:
stacked.unstack()

          0         1         2         3
0  0.460849  0.487761 -0.736919 -0.178876
1 -0.286265 -0.672739  0.979066  0.342475
2  0.243242 -0.250386  0.216199  1.492320
3 -1.111056 -0.790975 -1.231890 -1.527195
4 -2.352742  1.157813 -0.683316  1.037596
5 -1.704849  0.508804  1.362565 -2.113129
6 -1.415796  0.894546 -0.127387  0.787628
7 -0.107892  0.351823  0.287813  2.796400
8  0.477150  1.559146  1.677657  1.009932
9 -0.330902 -0.417962 -0.975267 -0.439529

In [38]:
df = pd.DataFrame(
    {
        "A": ["Company", "Product", "Type", "Quantity"] * 3,
        "B": ["Dell", "Lenovo", "HP"] * 4,
        "C": ["Note Book", "Note Book", "Note Book", "HD", "HD", "HD"] * 2,
        "D": np.random.randn(12),
        "E": np.random.randn(12),
    }
)
print(df)

           A       B          C         D         E
0    Company    Dell  Note Book -0.797724  1.008038
1    Product  Lenovo  Note Book -1.461776 -0.727293
2       Type      HP  Note Book  1.746624 -1.056507
3   Quantity    Dell         HD  1.061419 -1.396484
4    Company  Lenovo         HD -1.140606 -0.387861
5    Product      HP         HD  1.256128  0.798841
6       Type    Dell  Note Book  0.749519 -2.500420
7   Quantity  Lenovo  Note Book -1.240817  0.251336
8    Company      HP  Note Book  1.548197 -0.602205
9    Product    Dell         HD -0.591205  1.288721
10      Type  Lenovo         HD -0.560201  1.920338
11  Quantity      HP         HD -0.830342  0.299755

In [39]:
pd.pivot_table(df, values="D", index=["A", "B"], columns=["C"])

C                      HD  Note Book
A        B
Company  Dell         NaN  -0.797724
         HP           NaN   1.548197
         Lenovo -1.140606        NaN
Product  Dell   -0.591205        NaN
         HP      1.256128        NaN
         Lenovo       NaN  -1.461776
Quantity Dell    1.061419        NaN
         HP     -0.830342        NaN
         Lenovo       NaN  -1.240817
Type     Dell         NaN   0.749519
         HP           NaN   1.746624
         Lenovo -0.560201        NaN

In [40]:
rng = pd.date_range("1/1/2012", periods=100, freq="s")

ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)

ts.resample("5Min").sum()

2012-01-01    27211
Freq: 5min, dtype: int32

In [41]:
rng = pd.date_range("3/6/2012 00:00", periods=5, freq="D")

ts = pd.Series(np.random.randn(len(rng)), rng)

ts

2012-03-06    0.777774
2012-03-07   -0.544600
2012-03-08   -1.325956
2012-03-09   -0.258228
2012-03-10    1.291436
Freq: D, dtype: float64